In [52]:
import pandas as pd
import numpy as np

dict = {"Name":["Santhosh","Anand","Sreedevi",'Prashanth','Sachin'],
        "Age":[32,34,31,30,35],
        "Sex":["Male","Male","Female","Male","Male"],
         "Company":["ABB","Dell","Tesco","Tesco","Volvo"],
         "Grade":["P1","P2","P1","P3","P1"]}

df = pd.DataFrame(dict)

df

        Name  Age     Sex Company Grade
0   Santhosh   32    Male     ABB    P1
1      Anand   34    Male    Dell    P2
2   Sreedevi   31  Female   Tesco    P1
3  Prashanth   30    Male   Tesco    P3
4     Sachin   35    Male   Volvo    P1

In [53]:
# Create Dummpy Varibales using .map

df['Sex_Male'] = df['Sex'].map({"Female":0,"Male":1})

# Drop the Colum 'Sex'
df.drop('Sex',axis=1,inplace=True)

# Rename the Column 'Sex_Male' to Sex
df.rename(columns={"Sex_Male":'Sex'})

        Name  Age Company Grade  Sex
0   Santhosh   32     ABB    P1    1
1      Anand   34    Dell    P2    1
2   Sreedevi   31   Tesco    P1    0
3  Prashanth   30   Tesco    P3    1
4     Sachin   35   Volvo    P1    1

In [55]:
dict = {"Name":["Santhosh","Anand","Sreedevi",'Prashanth','Sachin'],
        "Age":[32,34,31,30,35],
        "Sex":["Male","Male","Female","Male","Male"],
         "Company":["ABB","Dell","Tesco","Tesco","Volvo"],
         "Grade":["P1","P2","P1","P3","P1"]}

df = pd.DataFrame(dict)

df

        Name  Age     Sex Company Grade
0   Santhosh   32    Male     ABB    P1
1      Anand   34    Male    Dell    P2
2   Sreedevi   31  Female   Tesco    P1
3  Prashanth   30    Male   Tesco    P3
4     Sachin   35    Male   Volvo    P1

In [56]:
# Alternative method for creating dummy variables
pd.get_dummies(df.Sex)

   Female  Male
0       0     1
1       0     1
2       1     0
3       0     1
4       0     1

In [57]:
# using iloc works on positions (integers)
pd.get_dummies(df.Sex, prefix='Sex').iloc[:, 1:]

   Sex_Male
0         1
1         1
2         0
3         1
4         1

In [58]:
# alternative using loc that works on labels
pd.get_dummies(df.Sex, prefix='Sex').loc[:, 'Sex':]

   Sex_Female  Sex_Male
0           0         1
1           0         1
2           1         0
3           0         1
4           0         1

In [59]:
# Get the Count of Unique elements in the column
df.Sex.value_counts()

Male      4
Female    1
Name: Sex, dtype: int64

In [60]:
# we only need k - 1, hence 2 dummy variables here
pd.get_dummies(df.Sex, prefix='Sex').iloc[:, 1:]

   Sex_Male
0         1
1         1
2         0
3         1
4         1

In [61]:
# create dummy variables for multiple categories
pd.get_dummies(df,columns=['Sex','Grade'])

        Name  Age Company  Sex_Female  Sex_Male  Grade_P1  Grade_P2  Grade_P3
0   Santhosh   32     ABB           0         1         1         0         0
1      Anand   34    Dell           0         1         0         1         0
2   Sreedevi   31   Tesco           1         0         1         0         0
3  Prashanth   30   Tesco           0         1         0         0         1
4     Sachin   35   Volvo           0         1         1         0         0

In [63]:
# create dummy variables for multiple categories along with drop the first categorical column
pd.get_dummies(df,columns=['Sex','Grade'],drop_first=True)

        Name  Age Company  Sex_Male  Grade_P2  Grade_P3
0   Santhosh   32     ABB         1         0         0
1      Anand   34    Dell         1         1         0
2   Sreedevi   31   Tesco         0         0         0
3  Prashanth   30   Tesco         1         0         1
4     Sachin   35   Volvo         1         0         0